import service_1 from '../../public/assets/service-1.svg'
import ServiceCard from './ServiceCard'


const Services = () => {
    const service = [
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        },
        {
            image: service_1,
            title: 'הסבירו במהירות החלטות, פסקי דין ומאמרים',
            desc: 'זהו כהרף עין נקודות מפתח, טיעונים עיקריים, פרטים חיוניים, ונימוקים במסמכים משפטיים, החלטות ופסקי דין.'
        }
    ]

    return (
        <div dir="rtl" className="my-2 md:my-20">
            <div>
                <h1 className="text-center text-[64px]">יישומים</h1>
                <p className="text-[#464349] text-center text-[24px]">אלו הן רק כמה מהתכונות שתיישמו באמצעות חמורבי.</p>
            </div>


            <div className='my-20'>
                {
                    service.map((item, index) => (<ServiceCard key={index} index={index} image={item.image} title={item.title} desc={item.desc} />))
                }
            </div>


        </div>
    )
}

export default Services